# Задача 1

a = int(input('Введите день недели: '))
if a >= 6 and a <= 7:
    print('Это выходной день!')
else:
    print('Это будний день.')
